# docs: https://github.com/Homebrew/homebrew-bundle
# tips: https://gist.github.com/ChristopherA/a579274536aab36ea9966f301ff14f3f
#
# `brew bundle install`
# -> Looks for ~/Brewfile and installs its contents

tap "oven-sh/bun" # https://github.com/oven-sh/homebrew-bun

# Basics
brew "git"
brew "coreutils"

# CLI apps
brew "nushell" # shell replaces bash/zsh and more
brew "gitmoji" # getting emojis for commit messages
brew "lazygit" # cli client for git
brew "lazydocker" # cli client for docker
brew "ghq" # download and manage git repos Golang style
brew "fzf" # fuzzy finder
brew "oh-my-posh" # prompt engine for nu and zsh
brew "carapace" # multi-shell completion library (for nushell)
brew "just" # better Makefiles
brew "bat" # better cat
brew "xh" # better httpie - interact with APIs (get, post, ...)
brew "bun" # better nodejs
brew "docker" # containers ftw 😅
brew "colima" # running Docker on MacOS
brew "fd" # better find
brew "sd" # better sed to replace stuff
brew "eza" # better ls to list stuff
brew "ripgrep" # better grep -> `rg`
brew "zoxide" # smarter `cd` command
brew "opencode" # AI coding agent for the terminal
brew "uv" # extremely fast Python package installer
brew "flyctl" # CLI tool for fly.io

# Desktop apps
cask "zed" # editor of choice over vscode
cask "arc" # browser
cask "ghostty" # terminal
cask "1password" # password manager
cask "1password-cli" # to use password manager in cli
cask "raycast" # productivity replaces Alfred and Spotlight, config synced via cloud
cask "setapp" # subscription service for some paid apps
cask "hammerspoon" # powerful automation with Lua (e.g. shortcuts or global mute)
cask "amethyst" # tiling window manager similar to xmonad
cask "spotify" # music streaming app of choice
cask "protonvpn" # VPN of choice
cask "orion" # alternative battery-saving browser
cask "betterdisplay" # be able to set the right resulotion for every display
cask "rocket" # slack like emojis everywhere
cask "mouseless" # vim-like and keyboard focused navigation

# https://github.com/apple/container
cask "container" # apple native tool run Linux containers as lightweight virtual machines

# Fonts
# TODO: Add MonoLisa as my main font
cask "font-symbols-only-nerd-font" # for Doom Emacs icon support
cask "font-jetbrains-mono-nerd-font" # most practical font
