Borke.puppet
christian-kohler.path-intellisense
codezombiech.gitignore
DavidAnson.vscode-markdownlint
donjayamanne.githistory
donjayamanne.python
dustinsanders.an-old-hope-theme-vscode
emmanuelbeziat.vscode-great-icons
Equinusocio.vsc-material-theme
felipecaputo.git-project-manager
helixquar.asciidecorator
lkytal.FlatUI
lukehoban.Go
marcostazi.VS-code-vagrantfile
ms-vscode.Theme-MarkdownKit
ms-vscode.wordcount
PeterJausovec.vscode-docker
PKief.material-icon-theme
rebornix.Ruby
robertohuertasm.vscode-icons
shakram02.bash-beautify
shardulm94.trailing-spaces
streetsidesoftware.code-spell-checker
Tyriar.theme-sapphire
webstp.extension-manager
