Borke.puppet
DavidAnson.vscode-markdownlint
codezombiech.gitignore
donjayamanne.githistory
dustinsanders.an-old-hope-theme-vscode
felipecaputo.git-project-manager
marcostazi.VS-code-vagrantfile
ms-vscode.wordcount
pprice.better-merge
rebornix.Ruby
robertohuertasm.vscode-icons
seanmcbreen.Spell
shardulm94.trailing-spaces
webstp.extension-manager
