akamud.vscode-theme-onedark
bierner.emojisense
bierner.markdown-emoji
christian-kohler.path-intellisense
codezombiech.gitignore
DavidAnson.vscode-markdownlint
donjayamanne.githistory
DotJoshJohnson.xml
dustinsanders.an-old-hope-theme-vscode
emmanuelbeziat.vscode-great-icons
Equinusocio.vsc-material-theme
felipecaputo.git-project-manager
foxundermoon.shell-format
helixquar.asciidecorator
jianbingfang.dupchecker
josa.markdown-table-formatter
jpogran.puppet-vscode
jprestidge.theme-material-theme
lkytal.FlatUI
lukehoban.Go
marcostazi.VS-code-vagrantfile
ms-python.python
ms-vscode.Theme-MarkdownKit
ms-vscode.wordcount
patbenatar.advanced-new-file
PeterJausovec.vscode-docker
PKief.material-icon-theme
rebornix.Ruby
rokoroku.vscode-theme-darcula
sallar.vscode-duotone-dark
shakram02.bash-beautify
shardulm94.trailing-spaces
sleistner.vscode-fileutils
streetsidesoftware.code-spell-checker
timonwong.shellcheck
Tyriar.sort-lines
Tyriar.theme-sapphire
webstp.extension-manager
